In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.]})

In [4]:
df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [5]:
df.groupby(['Animal']).mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [6]:
arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
          ['Captive', 'Wild', 'Captive', 'Wild']]

In [7]:
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))

In [8]:
df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
                  index=index)

In [9]:
df

                Max Speed
Animal Type
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0

In [12]:
df.groupby(level=0).mean()

        Max Speed
Animal
Falcon      370.0
Parrot       25.0

In [13]:
df.groupby(level="Type").mean()

         Max Speed
Type
Captive      210.0
Wild         185.0

In [14]:
l = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]

In [15]:
df = pd.DataFrame(l, columns=["a", "b", "c"])

In [16]:
df

   a    b  c
0  1  2.0  3
1  1  NaN  4
2  2  1.0  3
3  1  2.0  2

In [17]:
df.groupby(by=["b"]).sum()

     a  c
b
1.0  2  3
2.0  2  5

In [18]:
df.groupby(by=["b"], dropna=False).sum()

     a  c
b
1.0  2  3
2.0  2  5
NaN  1  4

In [19]:
l = [["a", 12, 12], [None, 12.3, 33.], ["b", 12.3, 123], ["a", 1, 1]]

In [20]:
df = pd.DataFrame(l, columns=["a", "b", "c"])

In [21]:
df

      a     b      c
0     a  12.0   12.0
1  None  12.3   33.0
2     b  12.3  123.0
3     a   1.0    1.0

In [22]:
df.groupby(by="a").sum()

      b      c
a
a  13.0   13.0
b  12.3  123.0

In [23]:
df.groupby(by="a", dropna=False).sum()

        b      c
a
a    13.0   13.0
b    12.3  123.0
NaN  12.3   33.0